RobertLukan/nrf9160-camera-upload/src/connection.c
		/* Notify that we have been requested to associate with a user account.
		 * This will cause the next NRF_CLOUD_EVT_USER_ASSOCIATED event to
		 * disconnect and reconnect the device to nRF Cloud, which is required
		 * when devices are first associated with an nRF Cloud account.
		 */
		notify_cloud_requested_association();
		break;
	case NRF_CLOUD_EVT_USER_ASSOCIATED:
		LOG_DBG("NRF_CLOUD_EVT_USER_ASSOCIATED");
		/* Indicates successful association with an nRF Cloud account.
		 * Will be fired every time the device connects.
		 * If an association request has been previously received from nRF Cloud,
		 * this means this is the first association of the device, and we must disconnect
		 * and reconnect to ensure proper function of the nRF Cloud connection.
		 */

		if (cloud_has_requested_association()) {
			/* We rely on the connection loop to reconnect automatically afterwards. */
			LOG_INF("Device successfully associated with cloud!");
			disconnect_cloud();
		}
		break;
	case NRF_CLOUD_EVT_READY:
		LOG_DBG("NRF_CLOUD_EVT_READY");
		/* Notify that nRF Cloud is ready for communications from us. */
		notify_cloud_ready();
		break;
	case NRF_CLOUD_EVT_SENSOR_DATA_ACK:
		LOG_DBG("NRF_CLOUD_EVT_SENSOR_DATA_ACK");
		break;
	case NRF_CLOUD_EVT_TRANSPORT_DISCONNECTED:
		LOG_DBG("NRF_CLOUD_EVT_TRANSPORT_DISCONNECTED");
		/* Notify that we have lost contact with nRF Cloud. */
		disconnect_cloud();
		break;
	case NRF_CLOUD_EVT_ERROR:
		LOG_DBG("NRF_CLOUD_EVT_ERROR: %d", nrf_cloud_evt->status);
		break;

	case NRF_CLOUD_EVT_RX_DATA_GENERAL:
		LOG_INF("NRF_CLOUD_EVT_RX_DATA_GENERAL");
	//	LOG_INF("%d bytes received from cloud", nrf_cloud_evt->data.len);
	//	LOG_INF("%d bytes received from cloud", nrf_cloud_evt->data.ptr);
		//nrf_cloud_data nrfCLoudData = nrf_cloud_evt->data.ptr;
	//	nrf_cloud_data  destination; 
		char grx_buf[1000];

		for(int i = 0; i < nrf_cloud_evt->data.len; i++) 
		{
				memcpy(&grx_buf[i], (uint8_t*) nrf_cloud_evt->data.ptr+i, 1);

		}
//		LOG_INF("%s bytes received from cloud",grx_buf);
		cJSON *json = cJSON_Parse(grx_buf);
		const cJSON *cGpio = NULL;
		const cJSON *msec = NULL;
		const cJSON *qValue = NULL;
		const cJSON *cameraFreq = NULL;


    	cGpio = cJSON_GetObjectItemCaseSensitive(json, "appId");
    	if (cJSON_IsString(cGpio) && (cGpio->valuestring != NULL))
    	{
        	if(!strcmp(cGpio->valuestring,"REBOOT"))
			{
				LOG_INF("Mathched Reboot\"%s\"\n", cGpio->valuestring);
				LOG_WRN("Rebooting...");
				LOG_PANIC();
				sys_reboot(SYS_REBOOT_COLD);
			}	
			else if(!strcmp(cGpio->valuestring,"GPIO"))
			{
				LOG_INF("Mathched \"%s\"\n", cGpio->valuestring);
				cameraCtr.takePictureNow = true;
			}
			else if(!strcmp(cGpio->valuestring,"DELAY"))
			{
				LOG_INF("Mathched \"%s\"\n", cGpio->valuestring);
				msec = cJSON_GetObjectItemCaseSensitive(json, "msec");
				cameraCtr.delayUdpSend = msec->valueint;
			}
			else if(!strcmp(cGpio->valuestring,"QUALITY"))
			{
				LOG_INF("Mathched \"%s\"\n", cGpio->valuestring);
				qValue = cJSON_GetObjectItemCaseSensitive(json, "value");
				cameraCtr.quality = qValue->valueint;
			}
			else if(!strcmp(cGpio->valuestring,"CAMERAFREQ"))
			{
				LOG_INF("Mathched \"%s\"\n", cGpio->valuestring);
				qValue = cJSON_GetObjectItemCaseSensitive(json, "value");
				cameraCtr.cameraFrequency = qValue->valueint;
			}
			else if(!strcmp(cGpio->valuestring,"SOLARCHARGERENABLE"))
			{
				LOG_INF("Mathched \"%s\"\n", cGpio->valuestring);
				qValue = cJSON_GetObjectItemCaseSensitive(json, "value");
				cameraCtr.solarChargerEnable = qValue->valueint;
			}
			else
			{
				LOG_INF("Not Mathched \"%s\"\n", cGpio->valuestring);

			}
		//	LOG_INF("Checking monitor \"%s\"\n", gpio->valuestring);
    	}
	//	char gpio = "gpio";
	//	memcpy(destination,nrf_cloud_evt->data.ptr, nrf_cloud_evt->data.len);

	//	if(decode_cloud_message(&nrf_cloud_evt, "temp", "read")) {
   	//		LOG_INF("Temperature read command received");
	//	}
		/* Pass the device message along to the application, if it is listening */
//		if (general_dev_msg_handler) {
			/* To keep the sample simple, we invoke the callback directly.
			 * If you want to do complex operations in this callback without blocking
			 * receipt of data from nRF Cloud, you should set up a work queue and pass
			 * messages to it either here, or from inside the callback.
			 *
			 * The data passed in needs to be null-terminated, but the nrf_cloud library
			 * always appends a trailing 0 to nrf_cloud_evt->data.ptr, so it will be.
			 */
//			general_dev_msg_handler(nrf_cloud_evt->data.ptr);
//		}

		break;
	case NRF_CLOUD_EVT_RX_DATA_SHADOW:
		LOG_DBG("NRF_CLOUD_EVT_RX_DATA_SHADOW");
		break;
	case NRF_CLOUD_EVT_FOTA_START:
		LOG_DBG("NRF_CLOUD_EVT_FOTA_START");
		break;
	case NRF_CLOUD_EVT_FOTA_DONE: {
		enum nrf_cloud_fota_type fota_type = NRF_CLOUD_FOTA_TYPE__INVALID;

		if (nrf_cloud_evt->data.ptr) {
			fota_type = *((enum nrf_cloud_fota_type *) nrf_cloud_evt->data.ptr);
		}

		LOG_DBG("NRF_CLOUD_EVT_FOTA_DONE, FOTA type: %s",
			fota_type == NRF_CLOUD_FOTA_APPLICATION	  ?		"Application"	:
			fota_type == NRF_CLOUD_FOTA_MODEM_DELTA	  ?		"Modem (delta)"	:
			fota_type == NRF_CLOUD_FOTA_MODEM_FULL	  ?		"Modem (full)"	:
			fota_type == NRF_CLOUD_FOTA_BOOTLOADER	  ?		"Bootloader"	:
										"Invalid");

		/* Notify fota_support of the completed download. */
		on_fota_downloaded();
		break;
	}
	case NRF_CLOUD_EVT_FOTA_ERROR:
		LOG_DBG("NRF_CLOUD_EVT_FOTA_ERROR");
		break;
	default:
		LOG_INF("Unknown event type: %d", nrf_cloud_evt->type);
		break;
	}
}

/**
 * @brief Handler for LTE events coming from modem.
 *
 * @param evt Events from modem.
 */
static void lte_event_handler(const struct lte_lc_evt *const evt)
{
	switch (evt->type) {
	case LTE_LC_EVT_NW_REG_STATUS:
		LOG_DBG("LTE_EVENT: Network registration status %d, %s", evt->nw_reg_status,
			evt->nw_reg_status == LTE_LC_NW_REG_NOT_REGISTERED ?	  "Not Registered" :
			evt->nw_reg_status == LTE_LC_NW_REG_REGISTERED_HOME ?	 "Registered Home" :
			evt->nw_reg_status == LTE_LC_NW_REG_SEARCHING ?		       "Searching" :
			evt->nw_reg_status == LTE_LC_NW_REG_REGISTRATION_DENIED ?
									     "Registration Denied" :
			evt->nw_reg_status == LTE_LC_NW_REG_UNKNOWN ?			 "Unknown" :
			evt->nw_reg_status == LTE_LC_NW_REG_REGISTERED_ROAMING ?
									      "Registered Roaming" :
			evt->nw_reg_status == LTE_LC_NW_REG_REGISTERED_EMERGENCY ?
									    "Registered Emergency" :
			evt->nw_reg_status == LTE_LC_NW_REG_UICC_FAIL ?		       "UICC Fail" :
											 "Invalid");

		if ((evt->nw_reg_status != LTE_LC_NW_REG_REGISTERED_HOME) &&
		     (evt->nw_reg_status != LTE_LC_NW_REG_REGISTERED_ROAMING)) {
			/* Clear connected status. */
			clear_lte_connected();

			/* Also reset the nRF Cloud connection if we were currently connected
			 * Failing to do this will result in nrf_cloud_send stalling upon connection
			 * re-establishment.
			 *
			 * We check cloud_is_disconnecting solely to avoid double-printing the
			 * LTE connection lost message. This check has no other effect.
			 */
			if (cloud_is_connected() && !cloud_is_disconnecting()) {
				LOG_INF("LTE connection lost. Disconnecting from nRF Cloud too...");
				disconnect_cloud();
			}
		} else {
			/* Notify we are connected to LTE. */
			notify_lte_connected();
		}

		break;
	case LTE_LC_EVT_PSM_UPDATE:
		LOG_DBG("LTE_EVENT: PSM parameter update: TAU: %d, Active time: %d",
			evt->psm_cfg.tau, evt->psm_cfg.active_time);
		break;
	case LTE_LC_EVT_EDRX_UPDATE: {
		/* This check is necessary to silence compiler warnings by
		 * sprintf when debug logs are not enabled.
		 */
		if (IS_ENABLED(CONFIG_MQTT_MULTI_SERVICE_LOG_LEVEL_DBG)) {
			char log_buf[60];
			ssize_t len;

			len = snprintf(log_buf, sizeof(log_buf),
				"LTE_EVENT: eDRX parameter update: eDRX: %f, PTW: %f",
				evt->edrx_cfg.edrx, evt->edrx_cfg.ptw);
			if (len > 0) {
				LOG_DBG("%s", log_buf);
			}
		}
		break;
	}
	case LTE_LC_EVT_RRC_UPDATE:
		LOG_DBG("LTE_EVENT: RRC mode: %s",
			evt->rrc_mode == LTE_LC_RRC_MODE_CONNECTED ?
			"Connected" : "Idle");
		break;
	case LTE_LC_EVT_CELL_UPDATE:
		LOG_DBG("LTE_EVENT: LTE cell changed: Cell ID: %d, Tracking area: %d",
			evt->cell.id, evt->cell.tac);
		break;
	case LTE_LC_EVT_LTE_MODE_UPDATE:
		LOG_DBG("LTE_EVENT: Active LTE mode changed: %s",
			evt->lte_mode == LTE_LC_LTE_MODE_NONE ? "None" :
			evt->lte_mode == LTE_LC_LTE_MODE_LTEM ? "LTE-M" :
			evt->lte_mode == LTE_LC_LTE_MODE_NBIOT ? "NB-IoT" :
			"Unknown");
		break;
	case LTE_LC_EVT_MODEM_EVENT:
		LOG_DBG("LTE_EVENT: Modem domain event, type: %s",
			evt->modem_evt == LTE_LC_MODEM_EVT_LIGHT_SEARCH_DONE ?
				"Light search done" :
			evt->modem_evt == LTE_LC_MODEM_EVT_SEARCH_DONE ?
				"Search done" :
			evt->modem_evt == LTE_LC_MODEM_EVT_RESET_LOOP ?
				"Reset loop detected" :
			evt->modem_evt == LTE_LC_MODEM_EVT_BATTERY_LOW ?
				"Low battery" :
			evt->modem_evt == LTE_LC_MODEM_EVT_OVERHEATED ?
				"Modem is overheated" :
				"Unknown");
		break;
	default:
		break;
	}
}

/**
 * @brief Updates the nRF Cloud shadow with information about supported capabilities, current
 *  firmware running, FOTA support, and so on.
 */
static void update_shadow(void)
{
	int err;
	struct nrf_cloud_svc_info_fota fota_info = {
		.application = nrf_cloud_fota_is_type_enabled(NRF_CLOUD_FOTA_APPLICATION),
		.bootloader = nrf_cloud_fota_is_type_enabled(NRF_CLOUD_FOTA_BOOTLOADER),
		.modem = nrf_cloud_fota_is_type_enabled(NRF_CLOUD_FOTA_MODEM_DELTA),
		.modem_full = nrf_cloud_fota_is_type_enabled(NRF_CLOUD_FOTA_MODEM_FULL)
	};

