RobertLukan/nrf9160-camera-upload/src/connection.c
	struct nrf_cloud_svc_info_ui ui_info = {
		.gnss = location_tracking_enabled(),
		.temperature = IS_ENABLED(CONFIG_TEMP_TRACKING),
		.button=0,
	};
	struct nrf_cloud_svc_info service_info = {
		.fota = &fota_info,
		.ui = &ui_info
	};
	struct nrf_cloud_device_status device_status = {
		.modem = NULL,
		.svc = &service_info
	};


	err = nrf_cloud_shadow_device_status_update(&device_status);
	if (err) {
		LOG_ERR("Failed to update device shadow, error: %d", err);
	}
}

int consume_device_message(void)
{
	char *msg;
	int ret;

	LOG_DBG("Consuming an enqueued device message");

	/* Wait until a message is available to send. */
	ret = k_msgq_get(&device_message_queue, &msg, K_FOREVER);
	if (ret) {
		LOG_ERR("Failed to retrieve item from outgoing message queue, error: %d", ret);
		return -ret;
	}

	/* Wait until we are able to send it. */
	LOG_DBG("Waiting for valid connection before transmitting device message");
	(void)await_connection(K_FOREVER);

	/* Attempt to send it.
	 *
	 * Note, it is possible (and better) to batch-send device messages when more than one is
	 * queued up. We limit this sample to sending individual messages mainly to keep the sample
	 * simple and accessible. See the Asset Tracker V2 application for an example of batch
	 * message sending.
	 */
	LOG_DBG("Attempting to transmit enqueued device message");

	struct nrf_cloud_tx_data mqtt_msg = {
		.data.ptr = msg,
		.data.len = strlen(msg),
		.qos = MQTT_QOS_1_AT_LEAST_ONCE,
		.topic_type = NRF_CLOUD_TOPIC_MESSAGE,
	};

	ret = nrf_cloud_send(&mqtt_msg);
	if (ret) {
		LOG_ERR("Transmission of enqueued device message failed, nrf_cloud_send "
			"gave error: %d. The message will be re-enqueued and tried again "
			"later.", ret);

		/* Re-enqueue the message for later retry (creating a new copy of it in heap). */
		send_device_message(msg);

		/* Increment the failure counter. */
		send_failure_count += 1;

		/* If we have failed too many times in a row, there is likely a bigger problem,
		 * and we should reset our connection to nRF Cloud, and wait for a few seconds.
		 */
		if (send_failure_count > CONFIG_MAX_CONSECUTIVE_SEND_FAILURES) {
			/* Disconnect. */
			disconnect_cloud();

			/* Wait for a few seconds before trying again. */
			k_sleep(K_SECONDS(CONFIG_CONSECUTIVE_SEND_FAILURE_COOLDOWN_SECONDS));
		}
	} else {
		LOG_DBG("Enqueued device message consumed successfully");

		/* Either overwrite the existing pattern with a short success pattern, or just
		 * disable the previously requested pattern, depending on if we are in verbose mode.
		 */
		if (IS_ENABLED(CONFIG_LED_VERBOSE_INDICATION)) {
			short_led_pattern(LED_SUCCESS);
		} else {
			stop_led_pattern();
		}

		/* Reset the failure counter, since we succeeded. */
		send_failure_count = 0;
	}

	/* Clean up. */
	k_free(msg);

	return ret;
}

int send_device_message(const char *const msg)
{
	/* Copy message data onto the heap (will be freed by the message consumer when done). */
	size_t len = strlen(msg) + 1;
	char *msg_buf = k_malloc(len);

	if (!msg_buf) {
		LOG_ERR("Could not alloc memory for new device message");
		return -ENOMEM;
	}
	strncpy(msg_buf, msg, len);
	LOG_DBG("Enqueued message: %s", msg_buf);

	/* Attempt to append data onto message queue. */
	if (k_msgq_put(&device_message_queue, &msg_buf, K_NO_WAIT)) {
		LOG_ERR("Device message rejected, outgoing message queue is full");
		k_free(msg_buf);
		return -ENOMEM;
	}

	return 0;
}

int send_device_message_cJSON(cJSON *msg_obj)
{
	int ret = 0;
	char *msg = NULL;

	if (!msg_obj) {
		LOG_ERR("Cannot send NULL device message object");
		return -EINVAL;
	}

	/* Convert message object to a string. */
	msg = cJSON_PrintUnformatted(msg_obj);
	if (msg == NULL) {
		LOG_ERR("Failed to convert cJSON device message object to string");
		return -ENOMEM;
	}

	/* Send the string as a device message. */
	ret = send_device_message(msg);

	/* Clean up */
	k_free(msg);
	return ret;
}

/**
 * @brief Close any connection to nRF Cloud, and reset connection status event state.
 * For internal use only. Externally, disconnect_cloud() may be used to trigger a disconnect.
 */
static void reset_cloud(void)
{
	int err;

	/* Wait for a few seconds to help residual events settle. */
	LOG_INF("Disconnecting from nRF Cloud");
	k_sleep(K_SECONDS(20));

	/* Disconnect from nRF Cloud */
	err = nrf_cloud_disconnect();

	/* nrf_cloud_uninit returns -EACCES if we are not currently in a connected state. */
	if (err == -EACCES) {
		LOG_INF("Cannot disconnect from nRF Cloud because we are not currently connected");
	} else if (err) {
		LOG_ERR("Cannot disconnect from nRF Cloud, error: %d. Continuing anyways", err);
	} else {
		LOG_INF("Successfully disconnected from nRF Cloud");
	}

	/* Clear cloud connection event state (reset to initial state). */
	clear_cloud_connection_events();
}

/**
 * @brief Establish a connection to nRF Cloud (presuming we are connected to LTE).
 *
 * @return int - 0 on success, otherwise negative error code.
 */
static int connect_cloud(void)
{
	int err;

	LOG_INF("Connecting to nRF Cloud...");

	/* Begin attempting to connect persistently. */
	while (true) {
		LOG_INF("Next connection retry in %d seconds",
			CONFIG_CLOUD_CONNECTION_RETRY_TIMEOUT_SECONDS);

		err = nrf_cloud_connect();
		if (err) {
			LOG_ERR("cloud_connect, error: %d", err);
		}

		/* Wait for cloud connection success. If succeessful, break out of the loop. */
		if (await_cloud_connected(
			K_SECONDS(CONFIG_CLOUD_CONNECTION_RETRY_TIMEOUT_SECONDS))) {
			break;
		}
	}

	/* Wait for cloud to become ready, resetting if we time out or are disconnected. */
	if (!await_cloud_ready(K_SECONDS(CONFIG_CLOUD_READY_TIMEOUT_SECONDS), true)) {
		LOG_INF("nRF Cloud failed to become ready. Resetting connection.");
		reset_cloud();
		return -ETIMEDOUT;
	}

	LOG_INF("Connected to nRF Cloud");

	return err;
}

/**
 * @brief Set up the modem library.
 *
 * @return int - 0 on success, otherwise a negative error code.
 */
static int setup_modem(void)
{
	/* Initialize the modem library if required */
	if (!IS_ENABLED(CONFIG_NRF_MODEM_LIB_SYS_INIT)) {
		/*
		 * If there is a pending modem delta firmware update stored, nrf_modem_lib_init will
		 * attempt to install it before initializing the modem library, and return a
		 * positive value to indicate that this occurred. This code can be used to
		 * determine whether the update was successful.
		 */
		int ret = nrf_modem_lib_init(NORMAL_MODE);

		if (ret < 0) {
			LOG_ERR("Modem library initialization failed, error: %d", ret);
			return ret;
		} else if (ret == NRF_MODEM_DFU_RESULT_OK) {
			LOG_DBG("Modem library initialized after "
				"successful modem firmware update.");
		} else if (ret > 0) {
			LOG_ERR("Modem library initialized after "
				"failed modem firmware update, error: %d", ret);
		} else {
			LOG_DBG("Modem library initialized.");
		}
	}

	/* Register to be notified when the modem has figured out the current time. */
	date_time_register_handler(date_time_evt_handler);

